[
	{
		"name": "state_code",
		"type": "STRING",
		"description": "The FIPS code of the state in which the monitor resides.",
		"mode": "NULLABLE"
	},
	{
		"name": "county_code",
		"type": "STRING",
		"description": "The FIPS code of the county in which the monitor resides.",
		"mode": "NULLABLE"
	},
	{
		"name": "site_num",
		"type": "STRING",
		"description": "A unique number within the county identifying the site.",
		"mode": "NULLABLE"
	},
	{
		"name": "parameter_code",
		"type": "INTEGER",
		"description": "The AQS code corresponding to the parameter measured by the monitor.",
		"mode": "NULLABLE"
	},
	{
		"name": "poc",
		"type": "INTEGER",
		"description": "This is the “Parameter Occurrence Code” used to distinguish different instruments that measure the same parameter at the same site.",
		"mode": "NULLABLE"
	},
	{
		"name": "latitude",
		"type": "FLOAT",
		"description": "The monitoring site’s angular distance north of the equator measured in decimal degrees.",
		"mode": "NULLABLE"
	},
	{
		"name": "longitude",
		"type": "FLOAT",
		"description": "The monitoring site’s angular distance east of the prime meridian measured in decimal degrees.",
		"mode": "NULLABLE"
	},
	{
		"name": "datum",
		"type": "STRING",
		"description": "The Datum associated with the Latitude and Longitude measures.",
		"mode": "NULLABLE"
	},
	{
		"name": "parameter_name",
		"type": "STRING",
		"description": "The name or description assigned in AQS to the parameter measured by the monitor. Parameters may be pollutants or non-pollutants.",
		"mode": "NULLABLE"
	},
	{
		"name": "date_local",
		"type": "DATE",
		"description": "The calendar date for the summary. All daily summaries are for the local standard day (midnight to midnight) at the monitor.",
		"mode": "NULLABLE"
	},
	{
		"name": "time_local",
		"type": "STRING",
		"description": "The time of day that sampling began on a 24-hour clock in Local Standard Time.",
		"mode": "NULLABLE"
	},
	{
		"name": "date_gmt",
		"type": "DATE",
		"description": "The calendar date of the sample in Greenwich Mean Time.",
		"mode": "NULLABLE"
	},
	{
		"name": "time_gmt",
		"type": "STRING",
		"description": "The time of day that sampling began on a 24-hour clock in Greenwich Mean Time.",
		"mode": "NULLABLE"
	},
	{
		"name": "sample_measurement",
		"type": "FLOAT",
		"description": "The measured value in the standard units of measure for the parameter.",
		"mode": "NULLABLE"
	},
	{
		"name": "units_of_measure",
		"type": "STRING",
		"description": "The unit of measure for the parameter. QAD always returns data in the standard units for the parameter. Submitters are allowed to report data in any unit and EPA converts to a standard unit so that we may use the data in calculations.",
		"mode": "NULLABLE"
	},
	{
		"name": "mdl",
		"type": "FLOAT",
		"description": "The Method Detection Limit. The minimum sample concentration detectable for the monitor and method. Note: if samples are reported below this level, they may have been replaced by 1/2 the MDL.",
		"mode": "NULLABLE"
	},
	{
		"name": "uncertainty",
		"type": "FLOAT",
		"description": "The total measurement uncertainty associated with a reported measurement as indicated by the reporting agency.",
		"mode": "NULLABLE"
	},
	{
		"name": "qualifier",
		"type": "STRING",
		"description": "Sample values may have qualifiers that indicate why they are missing or that they are out of the ordinary. Types of qualifiers are: null data, exceptional event, natural events, and quality assurance. The highest ranking qualifier, if any, is described in this field.",
		"mode": "NULLABLE"
	},
	{
		"name": "method_type",
		"type": "STRING",
		"description": "An indication of whether the method used to collect the data is a federal reference method (FRM), equivalent to a federal reference method, an approved regional method, or none of the above (non-federal reference method).",
		"mode": "NULLABLE"
	},
	{
		"name": "method_code",
		"type": "STRING",
		"description": "An internal system code indicating the method (processes, equipment, and protocols) used in gathering and measuring the sample. The method name is in the next column.",
		"mode": "NULLABLE"
	},
	{
		"name": "method_name",
		"type": "STRING",
		"description": "A short description of the processes, equipment, and protocols used in gathering and measuring the sample.",
		"mode": "NULLABLE"
	},
	{
		"name": "state_name",
		"type": "STRING",
		"description": "The name of the state where the monitoring site is located.",
		"mode": "NULLABLE"
	},
	{
		"name": "county_name",
		"type": "STRING",
		"description": "The name of the county where the monitoring site is located.",
		"mode": "NULLABLE"
	},
	{
		"name": "date_of_last_change",
		"type": "DATE",
		"description": "The date the last time any numeric values in this record were updated in the AQS data system.",
		"mode": "NULLABLE"
	}
]
