[
	{
		"name": "state_number",
		"type": "integer",
		"description": "This data element identifies the state in which the crash occurred. The codes are from the General Services Administration’s (GSA) publication of worldwide Geographic Location Codes (GLC). For more info on the codes, please look at <C1/V1/D1/PC1/P1/NM1 State Number> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
		"mode": "NULLABLE"
	},
	{
		"name": "state_name",
		"type": "string",
		"description": "This data element identifies the state in which the crash occurred. The codes are from the General Services Administration’s (GSA) publication of worldwide Geographic Location Codes (GLC).",
		"mode": "NULLABLE"
	},
	{
		"name": "consecutive_number",
		"type": "integer",
		"description": "This data element is the unique case number assigned to each crash. It appears on each data file and is used to merge information from the data files together. xxxxxx Two Characters for State Code followed by Four Characters for Case Number",
		"mode": "NULLABLE"
	},
	{
		"name": "vehicle_number",
		"type": "integer",
		"description": "This data element is the consecutive number assigned to each vehicle in the case. This data element appears on each vehicle level data file and is used in conjunction with the ST_CASE data element to merge information from vehicle level data files. 000-999 Assigned Number of Motor Vehicle",
		"mode": "NULLABLE"
	},
	{
		"name": "person_number",
		"type": "integer",
		"description": "This data element is the consecutive number assigned to each person in the case (i.e., each occupant, pedestrian, or non-motorists involved in the crash). This data element appears on each person level data file and is used in conjunction with the ST_CASE data element (and sometimes the VEH_NO data element) to merge information from person level data files. 001-999 Assigned Person Number",
		"mode": "NULLABLE"
	},
	{
		"name": "non_motorist_action_circumstances",
		"type": "integer",
		"description": "This data element describes the action(s) of the non-motorist immediately prior to their involvement in the crash. For more info on the codes, please look at <NM11 Non-Motorist Action/Circumstances> section in the pdf: https://crashstats.nhtsa.dot.gov/Api/Public/ViewPublication/812315",
		"mode": "NULLABLE"
	},
	{
		"name": "non_motorist_action_circumstances_name",
		"type": "string",
		"description": "This data element describes the action(s) of the non-motorist immediately prior to their involvement in the crash.",
		"mode": "NULLABLE"
	}
]
