[
  {
    "name": "stop_id",
    "type": "INTEGER",
    "description": "Identifies the serviced stop. Multiple routes can use the same stop.",
    "mode": "nullable"
  },
  {
    "name": "trip_id",
    "type": "INTEGER",
    "description": "Identifies a trip. Multiple trips can have the same stop",
    "mode": "nullable"
  },
  {
    "name": "stop_sequence",
    "type": "INTEGER",
    "description": "Identifies the order of the stops for a particular trip. The values for stop_sequence must increase throughout the trip but do not need to be consecutive.",
    "mode": "nullable"
  },
  {
    "name": "arrival_time",
    "type": "TIME",
    "description": "Specifies the scheduled arrival time at a specific stop for a specific trip on a route.",
    "mode": "nullable"
  },
  {
    "name": "arrives_next_day",
    "type": "BOOLEAN",
    "description": "Several routes begin before midnight, with service continuing throughout the night. This variable specifies whether arrival_time occurs after midnight the day after the scheduled day.  This is useful for identifying routes that begin one day and end the next day",
    "mode": "nullable"
  },
  {
    "name": "departure_time",
    "type": "TIME",
    "description": "Specifies the scheduled departure time at a specific stop for a specific trip on a route.",
    "mode": "nullable"
  },
  {
    "name": "departs_next_day",
    "type": "BOOLEAN",
    "description": "Several routes begin before midnight, with service continuing throughout the night. This variable specifies whether departure_time occurs after midnight the day after the scheduled day.  This is useful for identifying routes that begin one day and end the next day",
    "mode": "nullable"
  },
  {
    "name": "dropoff_type",
    "type": "STRING",
    "description": "Indicates whether riders are dropped off at a stop as part of the normal schedule or whether a drop off at the stop isn't available. Available options:  -  regular -  none -  phone (indicates must phone agency to arrange drop off) -  driver (indicates must coordinate with driver to arrange drop off)",
    "mode": "nullable"
  },
  {
    "name": "exact_timepoint",
    "type": "BOOLEAN",
    "description": "Indicates if the specified arrival and departure times for a stop are strictly adhered to by the transit vehicle, or if they're instead approximate or interpolated times.",
    "mode": "nullable"
  }
]
